УТ_для_edt/src/Catalogs/смартПравилаДанныхКонструктора/смартПравилаДанныхКонструктора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПравилаДанныхКонструктора</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НазначениеДанных</name>
    <type>
      <types>CatalogRef.смартНазначениеДанныхКонструктора</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.смартВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартПравилаДанныхКонструктора/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Схема = Справочники.смартПравилаДанныхКонструктора.ПолучитьМакет("УсловияКонструкторОборудования");
	НастройкиКомпоновки = Неопределено;
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		ОбъектИзБазы = РеквизитФормыВЗначение("Объект");
	
		СохраненныеНастройки = ОбъектИзБазы.Отбор.Получить();
		Если НЕ СохраненныеНастройки = Неопределено Тогда
			НастройкиКомпоновки = СохраненныеНастройки;
		КонецЕсли;
		
	Иначе
		Объект.Использовать = Истина;
	КонецЕсли;
	
	Если НастройкиКомпоновки = Неопределено Тогда
		НастройкиКомпоновки = Схема.НастройкиПоУмолчанию;
	КонецЕсли;
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор));
	КомпоновщикНастроекУсловий.Инициализировать(ИсточникНастроек);
		
	КомпоновщикНастроекУсловий.ЗагрузитьНастройки(НастройкиКомпоновки);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Отбор = Новый ХранилищеЗначения(КомпоновщикНастроекУсловий.Настройки, Новый СжатиеДанных(9));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ИспользоватьПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеДанныхПриИзменении(Элемент)
	
	ПроверитьНомерПоПорядку();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОборудованияПриИзменении(Элемент)
	
	ПроверитьНомерПоПорядку();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаШапка.ТолькоПросмотр = НЕ Объект.Использовать;
	Элементы.ГруппаУсловияПрименения.ТолькоПросмотр = НЕ Объект.Использовать;
	
КонецПроцедуры

Процедура ПроверитьНомерПоПорядку()
	
	Если Объект.НомерПоПорядку <> 0 Тогда
		Если Объект.НазначениеДанных <> объект.Ссылка.НазначениеДанных
			ИЛИ Объект.ВидОборудования <> объект.Ссылка.ВидОборудования Тогда
			
			Объект.НомерПоПорядку = 0;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
